---
kind: other
id: Methods.T:Autodesk.Revit.DB.PlanCircuitSetIterator
source: html/3f4e975f-b617-abc3-a531-8f03e1ede355.htm
---
# PlanCircuitSetIterator Methods

Causes the object to release immediately any resources it may be utilizing.